opends/tests/functional-tests/shared/data/dsml/suites/08miscsuite/data/091_bind_4.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 932
Authorization: Basic %VALIDAUTH%
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
		
        <modifyRequest dn="cn=pablo picasso+uid=00123456789,ou=search,o=imc,c=us">
          <modification name="userpassword" operation="replace">
               <value>pablo</value>
          </modification>
        </modifyRequest>
	
        <modifyRequest dn="o=IMC, c=US">
          <modification name="aci" operation="add">
               <value>(targetattr = "*") (version 3.0;acl "Pablo";allow (all)(userdn = "ldap:///cn=pablo picasso+uid=00123456789,ou=search,o=imc,c=us");)</value>
          </modification>
        </modifyRequest>

      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
